In [1]:
import pandas as pd

# 1. loading a file from local disk

In [5]:
df = pd.read_csv('amazon_jobs_dataset.csv')
df

,Unnamed: 0,Title,location,Posting_date,DESCRIPTION,BASIC QUALIFICATIONS,PREFERRED QUALIFICATIONS
0,0,Software Development Manager,"US, WA, Seattle","March 1, 2018",You are an experienced hands-on manager with a...,· Proven track record of hiring and managing h...,· Experience building extremely high volume an...
1,1,Software Development Engineer,"IN, KA, Bangalore","March 1, 2018",Amazon is driven by being “the world’s most cu...,· Bachelor’s Degree in Computer Science or rel...,· Experience building complex software systems...
2,2,Software Development Engineer,"IN, KA, Bangalore","March 1, 2018",Amazon is driven by being “the world’s most cu...,· Bachelor’s Degree in Computer Science or rel...,· Experience building complex software systems...
3,3,Software Development Engineer - Amazon Lex,"US, WA, Seattle","March 1, 2018",Have you ever wondered what it takes to build ...,· Bachelors Degree in Computer Science or a re...,· Masters or PhD in Computer Science· Experien...
4,4,Software Development Engineer - Amazon Lex,"US, WA, Seattle","March 1, 2018",Have you ever wondered what it takes to build ...,· Bachelors Degree in Computer Science or a re...,· Masters or PhD in Computer Science· Experien...
...,...,...,...,...,...,...,...
3488,3488,Software Engineer,"US, NV, Las Vegas","August 29, 2012",What are you currently doing? We’re building a...,· 5+ years production Java software developmen...,· 7+ years Java software development in a prod...
3489,3489,Software Development Engineer,"US, WA, Seattle","April 23, 2012",At Amazon Voice and Advanced Natural Shopping ...,* Bachelor’s Degree in Computer Science or rel...,* Experience building complex software systems...
3490,3490,Software Development Engineer III - Mar. BR 2012,"US, WA, Seattle","March 6, 2012",Employer: Amazon Corporate LLCPosition: Softwa...,Basic Qualifications:Education: Master’s degre...,-
3491,3491,Software Development Engineer in Test II - IMM546,"US, WA, Seattle","November 28, 2011",POSITIONS AVAILABLECompany: Amazon Corporate L...,-,-
3492,3492,Software Development Engineer in Test,"US, WA, Seattle","July 7, 2011",Kindle and Amazon are impacting the world with...,"· Bachelor’s degree in Computer Science, Compu...",· Experience with open source tools and resour...

#  2. Loading a file from URL

In [4]:
pd.read_csv("https://raw.githubusercontent.com/mwaskom/seaborn-data/master/iris.csv")

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

# 3. loading a file which have different separator (TSV file tab separated)

In [8]:
pd.read_csv('demo_data.tsv')

            ID\tName\tAge\tCity\tSalary
0         1\tPerson_1\t56\tDelhi\t95733
1      2\tPerson_2\t46\tChennai\t119045
2        3\tPerson_3\t32\tMumbai\t64698
3        4\tPerson_4\t25\tDelhi\t110623
4       5\tPerson_5\t38\tKolkata\t52671
..                                  ...
95  96\tPerson_96\t59\tBangalore\t49738
96      97\tPerson_97\t56\tDelhi\t60746
97    98\tPerson_98\t58\tKolkata\t79377
98    99\tPerson_99\t45\tChennai\t78404
99   100\tPerson_100\t24\tMumbai\t84045

[100 rows x 1 columns]

In [7]:
pd.read_csv('demo_data.tsv', sep = '\t')

     ID        Name  Age       City  Salary
0     1    Person_1   56      Delhi   95733
1     2    Person_2   46    Chennai  119045
2     3    Person_3   32     Mumbai   64698
3     4    Person_4   25      Delhi  110623
4     5    Person_5   38    Kolkata   52671
..  ...         ...  ...        ...     ...
95   96   Person_96   59  Bangalore   49738
96   97   Person_97   56      Delhi   60746
97   98   Person_98   58    Kolkata   79377
98   99   Person_99   45    Chennai   78404
99  100  Person_100   24     Mumbai   84045

[100 rows x 5 columns]

# 4. loading a no header dataset with columns

In [12]:
# without any parameter

pd.read_csv('demo_data_noheader.csv')

      1    Person_1  56      Delhi   95733
0     2    Person_2  46    Chennai  119045
1     3    Person_3  32     Mumbai   64698
2     4    Person_4  25      Delhi  110623
3     5    Person_5  38    Kolkata   52671
4     6    Person_6  56  Bangalore   55184
..  ...         ...  ..        ...     ...
94   96   Person_96  59  Bangalore   49738
95   97   Person_97  56      Delhi   60746
96   98   Person_98  58    Kolkata   79377
97   99   Person_99  45    Chennai   78404
98  100  Person_100  24     Mumbai   84045

[99 rows x 5 columns]

In [27]:
# with name parameter

pd.read_csv('demo_data_noheader.csv', names=['a','b','c','d','e'])

      a           b   c          d       e
0     1    Person_1  56      Delhi   95733
1     2    Person_2  46    Chennai  119045
2     3    Person_3  32     Mumbai   64698
3     4    Person_4  25      Delhi  110623
4     5    Person_5  38    Kolkata   52671
..  ...         ...  ..        ...     ...
95   96   Person_96  59  Bangalore   49738
96   97   Person_97  56      Delhi   60746
97   98   Person_98  58    Kolkata   79377
98   99   Person_99  45    Chennai   78404
99  100  Person_100  24     Mumbai   84045

[100 rows x 5 columns]

# 5. loading a dataset having index column as one of its attribute

In [15]:
pd.read_csv('demo_data_noheader.csv', names=['a','b','c','d','e'], index_col = 'a') # a become index

              b   c          d       e
a
1      Person_1  56      Delhi   95733
2      Person_2  46    Chennai  119045
3      Person_3  32     Mumbai   64698
4      Person_4  25      Delhi  110623
5      Person_5  38    Kolkata   52671
..          ...  ..        ...     ...
96    Person_96  59  Bangalore   49738
97    Person_97  56      Delhi   60746
98    Person_98  58    Kolkata   79377
99    Person_99  45    Chennai   78404
100  Person_100  24     Mumbai   84045

[100 rows x 4 columns]

# 6. Header parameter (if we getting column as a row)

In [29]:
pd.read_csv('header_in_rows.csv',header=1) # making first row as header

      1    Person_1  56      Delhi   95733
0     2    Person_2  46    Chennai  119045
1     3    Person_3  32     Mumbai   64698
2     4    Person_4  25      Delhi  110623
3     5    Person_5  38    Kolkata   52671
4     6    Person_6  56  Bangalore   55184
..  ...         ...  ..        ...     ...
94   96   Person_96  59  Bangalore   49738
95   97   Person_97  56      Delhi   60746
96   98   Person_98  58    Kolkata   79377
97   99   Person_99  45    Chennai   78404
98  100  Person_100  24     Mumbai   84045

[99 rows x 5 columns]

# 7. Importing dataset with desired columns only

In [33]:
pd.read_csv('demo_data.tsv',sep='\t',usecols = ['ID','Salary'])

     ID  Salary
0     1   95733
1     2  119045
2     3   64698
3     4  110623
4     5   52671
..  ...     ...
95   96   49738
96   97   60746
97   98   79377
98   99   78404
99  100   84045

[100 rows x 2 columns]

# 8. skip rows while loading a dataset

In [39]:
pd.read_csv('terrorismData.csv',skiprows=[0,1,5])

,1970,0,0.1,Mexico,Federal,North America,Mexico city,19.371887,-99.086624,Hostage Taking (Kidnapping),0.0,0.0.1,"Nadine Chaval, daughter",Unnamed: 13,23rd of September Communist League,Government (Diplomatic),Unknown
0,1970,1,0,Philippines,Tarlac,Southeast Asia,Unknown,15.478598,120.599741,Assassination,1.0,0.0,Employee,NaN,Unknown,Journalists & Media,Unknown
1,1970,1,0,Greece,Attica,Western Europe,Athens,37.997490,23.762728,Bombing/Explosion,NaN,NaN,U.S. Embassy,NaN,Unknown,Government (Diplomatic),Explosives
2,1970,1,1,United States,Illinois,North America,Cairo,37.005105,-89.176269,Armed Assault,0.0,0.0,Cairo Police Headquarters,1/1/1970: Unknown African American assailants ...,Black Nationalists,Police,Firearms
3,1970,1,2,Uruguay,Montevideo,South America,Montevideo,-34.891151,-56.187214,Assassination,0.0,0.0,Juan Maria de Lucah/Chief of Directorate of in...,NaN,Tupamaros (Uruguay),Police,Firearms
4,1970,1,2,United States,California,North America,Oakland,37.791927,-122.225906,Bombing/Explosion,0.0,0.0,Edes Substation,1/2/1970: Unknown perpetrators detonated explo...,Unknown,Utilities,Explosives
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
181683,2017,12,31,Somalia,Middle Shebelle,Sub-Saharan Africa,Ceelka Geelow,2.359673,45.385034,Armed Assault,1.0,2.0,Checkpoint,12/31/2017: Assailants opened fire on a Somali...,Al-Shabaab,Military,Firearms
181684,2017,12,31,Syria,Lattakia,Middle East & North Africa,Jableh,35.407278,35.942679,Bombing/Explosion,2.0,7.0,Hmeymim Air Base,12/31/2017: Assailants launched mortars at the...,Muslim extremists,Military,Explosives
181685,2017,12,31,Philippines,Maguindanao,Southeast Asia,Kubentog,6.900742,124.437908,Facility/Infrastructure Attack,0.0,0.0,Houses,12/31/2017: Assailants set fire to houses in K...,Bangsamoro Islamic Freedom Movement (BIFM),Private Citizens & Property,Incendiary
181686,2017,12,31,India,Manipur,South Asia,Imphal,24.798346,93.940430,Bombing/Explosion,0.0,0.0,Office,12/31/2017: Assailants threw a grenade at a Fo...,Unknown,Government (General),Explosives
181687,2017,12,31,Philippines,Maguindanao,Southeast Asia,Cotabato City,7.209594,124.241966,Bombing/Explosion,0.0,0.0,Unknown,12/31/2017: An explosive device was discovered...,Unknown,Unknown,Explosives

In [ ]:
# we can also pass function as parameter also
def fun():
    i = []
    for j in range(100):
        if j%2 == 0:
            i.append(j)
            
    return i

# skipping even rows for first 100 rows

pd.read_csv('terrorismData.csv',skiprows=fun()).head()

# 9. Loadidng a dataset with dfferent encoding

In [46]:
pd.read_csv('zomato.csv', encoding='latin-1').head(2)

,Restaurant ID,Restaurant Name,Country Code,City,Address,Locality,Locality Verbose,Longitude,Latitude,Cuisines,...,Currency,Has Table booking,Has Online delivery,Is delivering now,Switch to order menu,Price range,Aggregate rating,Rating color,Rating text,Votes
0,6317637,Le Petit Souffle,162,Makati City,"Third Floor, Century City Mall, Kalayaan Avenu...","Century City Mall, Poblacion, Makati City","Century City Mall, Poblacion, Makati City, Mak...",121.027535,14.565443,"French, Japanese, Desserts",...,Botswana Pula(P),Yes,No,No,No,3,4.8,Dark Green,Excellent,314
1,6304287,Izakaya Kikufuji,162,Makati City,"Little Tokyo, 2277 Chino Roces Avenue, Legaspi...","Little Tokyo, Legaspi Village, Makati City","Little Tokyo, Legaspi Village, Makati City, Ma...",121.014101,14.553708,Japanese,...,Botswana Pula(P),Yes,No,No,No,3,4.5,Dark Green,Excellent,591

# 10. we can also handles date using parse_dates

# 11. uisng converters

In [49]:
import pandas as pd
from io import StringIO

# Create a small CSV text for demo
csv_data = """ID,Name,Salary,Joining_Date
1,John,45000,2020-01-10
2,Alice,55000,2021-03-15
3,Bob,60000,2022-05-22
4,David,50000,2020-12-01
"""

# Use StringIO to simulate reading from a file
data = StringIO(csv_data)

# Define converter functions
def convert_salary(x):
    return float(x) / 1000   # convert salary to 'thousands'

def convert_date(x):
    return pd.to_datetime(x).strftime("%b-%Y")  # format date

# Read CSV using converters
df = pd.read_csv(
    data,
    converters={
        "Salary": convert_salary,      # apply to Salary column
        "Joining_Date": convert_date   # apply to Joining_Date column
    }
)

print(df)

   ID   Name  Salary Joining_Date
0   1   John    45.0     Jan-2020
1   2  Alice    55.0     Mar-2021
2   3    Bob    60.0     May-2022
3   4  David    50.0     Dec-2020

# 12. handiling na_values while loading a datset

we can pass which values to replace as nan while loading our dataset

# 13. loading larger dataset in chunks of dataset

In [52]:
pd.read_csv('terrorismData.csv')

,Year,Month,Day,Country,State,Region,City,Latitude,Longitude,AttackType,Killed,Wounded,Target,Summary,Group,Target_type,Weapon_type
0,1970,7,2,Dominican Republic,NaN,Central America & Caribbean,Santo Domingo,18.456792,-69.951164,Assassination,1.0,0.0,Julio Guzman,NaN,MANO-D,Private Citizens & Property,Unknown
1,1970,0,0,Mexico,Federal,North America,Mexico city,19.371887,-99.086624,Hostage Taking (Kidnapping),0.0,0.0,"Nadine Chaval, daughter",NaN,23rd of September Communist League,Government (Diplomatic),Unknown
2,1970,1,0,Philippines,Tarlac,Southeast Asia,Unknown,15.478598,120.599741,Assassination,1.0,0.0,Employee,NaN,Unknown,Journalists & Media,Unknown
3,1970,1,0,Greece,Attica,Western Europe,Athens,37.997490,23.762728,Bombing/Explosion,NaN,NaN,U.S. Embassy,NaN,Unknown,Government (Diplomatic),Explosives
4,1970,1,0,Japan,Fukouka,East Asia,Fukouka,33.580412,130.396361,Facility/Infrastructure Attack,NaN,NaN,U.S. Consulate,NaN,Unknown,Government (Diplomatic),Incendiary
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
181686,2017,12,31,Somalia,Middle Shebelle,Sub-Saharan Africa,Ceelka Geelow,2.359673,45.385034,Armed Assault,1.0,2.0,Checkpoint,12/31/2017: Assailants opened fire on a Somali...,Al-Shabaab,Military,Firearms
181687,2017,12,31,Syria,Lattakia,Middle East & North Africa,Jableh,35.407278,35.942679,Bombing/Explosion,2.0,7.0,Hmeymim Air Base,12/31/2017: Assailants launched mortars at the...,Muslim extremists,Military,Explosives
181688,2017,12,31,Philippines,Maguindanao,Southeast Asia,Kubentog,6.900742,124.437908,Facility/Infrastructure Attack,0.0,0.0,Houses,12/31/2017: Assailants set fire to houses in K...,Bangsamoro Islamic Freedom Movement (BIFM),Private Citizens & Property,Incendiary
181689,2017,12,31,India,Manipur,South Asia,Imphal,24.798346,93.940430,Bombing/Explosion,0.0,0.0,Office,12/31/2017: Assailants threw a grenade at a Fo...,Unknown,Government (General),Explosives
181690,2017,12,31,Philippines,Maguindanao,Southeast Asia,Cotabato City,7.209594,124.241966,Bombing/Explosion,0.0,0.0,Unknown,12/31/2017: An explosive device was discovered...,Unknown,Unknown,Explosives

In [58]:
dfs = pd.read_csv('terrorismData.csv', chunksize= 5000)

In [60]:
# we can perform any operations as chunks
for chunks in dfs:
    print(chunks.shape)

(5000, 17)
(5000, 17)
(5000, 17)
(5000, 17)
(5000, 17)
(5000, 17)
(5000, 17)
(5000, 17)
(5000, 17)
(5000, 17)
(5000, 17)
(5000, 17)
(5000, 17)
(5000, 17)
(5000, 17)
(5000, 17)
(5000, 17)
(5000, 17)
(5000, 17)
(5000, 17)
(5000, 17)
(5000, 17)
(5000, 17)
(5000, 17)
(5000, 17)
(5000, 17)
(5000, 17)
(5000, 17)
(5000, 17)
(5000, 17)
(5000, 17)
(5000, 17)
(5000, 17)
(5000, 17)
(5000, 17)
(1691, 17)